#include <string.h>
#include <conio.h>
#include <stdlib.h>
#include <stdio.h>


/*Составить программу, которая запись любого данного
числа n (n<=3999) арабскими цифрами переводила бы
в запись римскими*/
void main()
{
	clrscr();

	int n, i = 12;

	//двумерный массив для строк.
	//перв.индекс динамич., второй 3 (два симв макс + конец строки)
	char rim[][3] = {"I", "IV", "V", "IX", "X", "XL", "L",
					"XC", "C", "CD", "D", "CM", "M"};

	int arab[] = {1, 4, 5, 9, 10, 40, 50,
					90, 100, 400, 500, 900, 1000};

	printf("Введите число от 1 до 3999 ");
	scanf("%i", &n);

	if (n < 1 || n > 3999)
	{
		printf("\nЧисло за границами указанного диапазона!");
		getch();
		return;
	}

	while (n > 0)
	{
		while (arab[i] > n)
			i--;

		cputs(rim[i]);
		n -= arab[i];	
	}


	getch();
}