#include <stdio.h>
#include <conio.h>
#include <stdlib.h>
#include <string.h>

/*5 Написать программу, которая выводит на экран первую
часть таблицы кодировки символов (символы с кодами от 0 до 127).
Таблица должна состоять из восьми колонок и шестнадцати строк.
В первой колонке должны быть символы с кодом от 0 до 15,
во второй от 16 до 31 и т.д*/
 void main()
 {
	clrscr();

	int i, j, k = 0, kod = 0;
	char s;

	for(i = 1; i <= 16; i++)
	{
		kod = k;
		for (j = 1; j <= 8; j++)
		{	
			s = kod;
			printf("%c - %3i\t", s, s);
			kod += 16;
		}
		
		k++;
		printf("\n");
	}

	getch();
 }